tutorials/staticBubble/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   5e-2;

vertices
(
    ( 0  0  0  ) //0
    ( 1  0  0  ) //1
    ( 1  1  0  ) //2
    ( 0  1  0  ) //3
    ( 0  0  0.1 ) //4
    ( 1  0  0.1 ) //5
    ( 1  1  0.1 ) //6
    ( 0  1  0.1 ) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    back
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    topAndBottom
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (3 2 1 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
